Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.SeamInputType Enumeration
 Defines the type of the input.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SeamInputType
Public Enumeration SeamInputType
Members
Member name | Value | Description
INPUT_2_POINTS | 1 |  The input is two points. The data is returned as an array list of points.
INPUT_POLYGON | 2 |  The input is any number of points (a polygon). The data is returned as an array list of points.
See Also
Reference
Tekla.Structures.Plugins Namespace